app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.special_blogs.page(params[:page]).per(5)
---
SELECT "blogs".* FROM "blogs"